### One Hot Encoding - > use for output columns

In [39]:
import pandas as pd
import numpy as np

In [40]:
df = pd.read_csv('cars.csv')
df.sample(5)

         brand  km_driven    fuel         owner  selling_price
876       Tata     100000  Diesel  Second Owner         120000
4085     Honda      54000  Petrol   First Owner         625000
7782  Mahindra      70000  Diesel   First Owner         800000
768     Maruti     120000  Diesel  Second Owner         420000
4232     Skoda      11000  Petrol   First Owner         645000

In [41]:
df['fuel'].value_counts()

fuel
Diesel    4402
Petrol    3631
CNG         57
LPG         38
Name: count, dtype: int64

## One Hot Encoding using Pandas

In [42]:
pd.get_dummies( df , columns=['fuel' , 'owner'])

,brand,km_driven,selling_price,fuel_CNG,fuel_Diesel,fuel_LPG,fuel_Petrol,owner_First Owner,owner_Fourth & Above Owner,owner_Second Owner,owner_Test Drive Car,owner_Third Owner
0,Maruti,145500,450000,False,True,False,False,True,False,False,False,False
1,Skoda,120000,370000,False,True,False,False,False,False,True,False,False
2,Honda,140000,158000,False,False,False,True,False,False,False,False,True
3,Hyundai,127000,225000,False,True,False,False,True,False,False,False,False
4,Maruti,120000,130000,False,False,False,True,True,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...
8123,Hyundai,110000,320000,False,False,False,True,True,False,False,False,False
8124,Hyundai,119000,135000,False,True,False,False,False,True,False,False,False
8125,Maruti,120000,382000,False,True,False,False,True,False,False,False,False
8126,Tata,25000,290000,False,True,False,False,True,False,False,False,False
8127,Tata,25000,290000,False,True,False,False,True,False,False,False,False

## K-1 One Hot Encoding
**drop first column**

In [43]:
pd.get_dummies( df , columns=['fuel' , 'owner'] , drop_first=True)

,brand,km_driven,selling_price,fuel_Diesel,fuel_LPG,fuel_Petrol,owner_Fourth & Above Owner,owner_Second Owner,owner_Test Drive Car,owner_Third Owner
0,Maruti,145500,450000,True,False,False,False,False,False,False
1,Skoda,120000,370000,True,False,False,False,True,False,False
2,Honda,140000,158000,False,False,True,False,False,False,True
3,Hyundai,127000,225000,True,False,False,False,False,False,False
4,Maruti,120000,130000,False,False,True,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...
8123,Hyundai,110000,320000,False,False,True,False,False,False,False
8124,Hyundai,119000,135000,True,False,False,True,False,False,False
8125,Maruti,120000,382000,True,False,False,False,False,False,False
8126,Tata,25000,290000,True,False,False,False,False,False,False
8127,Tata,25000,290000,True,False,False,False,False,False,False

##  One Hot Encoding using sklearn

In [44]:
df.head()

     brand  km_driven    fuel         owner  selling_price
0   Maruti     145500  Diesel   First Owner         450000
1    Skoda     120000  Diesel  Second Owner         370000
2    Honda     140000  Petrol   Third Owner         158000
3  Hyundai     127000  Diesel   First Owner         225000
4   Maruti     120000  Petrol   First Owner         130000

In [52]:
from sklearn.model_selection import train_test_split

x_train , x_test , y_train , y_test = train_test_split(df.iloc[ : , :4] , df.iloc[ : , -1] , test_size = 0.2)

In [53]:
x_train.head()

           brand  km_driven    fuel         owner
4391  Volkswagen     108000  Diesel   First Owner
6013  Volkswagen       7949  Petrol   First Owner
4804       Honda      70000  Diesel   First Owner
1736     Hyundai       5000  Petrol   First Owner
4554      Maruti      99000  Petrol  Second Owner

In [54]:
from sklearn.preprocessing import OneHotEncoder

ohe = OneHotEncoder( drop='first' , sparse_output=False , dtype=np.int32 )

In [55]:
x_train_n = ohe.fit_transform( x_train[ [ 'fuel' , 'owner' ] ] )
x_test_n = ohe.transform( x_train[ [ 'fuel' , 'owner' ] ] )

In [56]:
x_train_n.shape

(6502, 7)

In [57]:
df.head()

     brand  km_driven    fuel         owner  selling_price
0   Maruti     145500  Diesel   First Owner         450000
1    Skoda     120000  Diesel  Second Owner         370000
2    Honda     140000  Petrol   Third Owner         158000
3  Hyundai     127000  Diesel   First Owner         225000
4   Maruti     120000  Petrol   First Owner         130000

In [58]:
x_test_n

array([[1, 0, 0, ..., 0, 0, 0],
       [0, 0, 1, ..., 0, 0, 0],
       [1, 0, 0, ..., 0, 0, 0],
       ...,
       [1, 0, 0, ..., 0, 0, 1],
       [1, 0, 0, ..., 0, 0, 0],
       [1, 0, 0, ..., 1, 0, 0]], shape=(6502, 7), dtype=int32)

In [64]:
np.hstack(( x_train[['brand' , 'km_driven']].values , x_train_n))

array([['Volkswagen', 108000, 1, ..., 0, 0, 0],
       ['Volkswagen', 7949, 0, ..., 0, 0, 0],
       ['Honda', 70000, 1, ..., 0, 0, 0],
       ...,
       ['Ford', 110000, 1, ..., 0, 0, 1],
       ['Tata', 90000, 1, ..., 0, 0, 0],
       ['Volkswagen', 120000, 1, ..., 1, 0, 0]],
      shape=(6502, 9), dtype=object)

### One Hot Encoding with top categories

In [80]:
counts = df['brand'].value_counts()
counts

brand
Maruti           2448
Hyundai          1415
Mahindra          772
Tata              734
Toyota            488
Honda             467
Ford              397
Chevrolet         230
Renault           228
Volkswagen        186
BMW               120
Skoda             105
Nissan             81
Jaguar             71
Volvo              67
Datsun             65
Mercedes-Benz      54
Fiat               47
Audi               40
Lexus              34
Jeep               31
Mitsubishi         14
Force               6
Land                6
Isuzu               5
Kia                 4
Ambassador          4
Daewoo              3
MG                  3
Ashok               1
Opel                1
Peugeot             1
Name: count, dtype: int64

In [81]:
df['brand'].unique()
threshold = 100

In [83]:
replace = counts[ counts <= threshold ].index
replace

Index(['Nissan', 'Jaguar', 'Volvo', 'Datsun', 'Mercedes-Benz', 'Fiat', 'Audi',
       'Lexus', 'Jeep', 'Mitsubishi', 'Force', 'Land', 'Isuzu', 'Kia',
       'Ambassador', 'Daewoo', 'MG', 'Ashok', 'Opel', 'Peugeot'],
      dtype='object', name='brand')

In [84]:
pd.get_dummies( df['brand'].replace( replace , 'Other' ) , drop_first=True )

,Chevrolet,Ford,Honda,Hyundai,Mahindra,Maruti,Other,Renault,Skoda,Tata,Toyota,Volkswagen
0,False,False,False,False,False,True,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,True,False,False,False
2,False,False,True,False,False,False,False,False,False,False,False,False
3,False,False,False,True,False,False,False,False,False,False,False,False
4,False,False,False,False,False,True,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...
8123,False,False,False,True,False,False,False,False,False,False,False,False
8124,False,False,False,True,False,False,False,False,False,False,False,False
8125,False,False,False,False,False,True,False,False,False,False,False,False
8126,False,False,False,False,False,False,False,False,False,True,False,False
8127,False,False,False,False,False,False,False,False,False,True,False,False